fio_result/test_xvdq1_64/fio.randwrite.64K.1.log
/dev/xvdo1: (g=0): rw=randwrite, bs=64K-64K/64K-64K/64K-64K, ioengine=libaio, iodepth=64
fio-2.0.13
Starting 1 process

/dev/xvdo1: (groupid=0, jobs=1): err= 0: pid=31190: Sun Jun 29 06:28:12 2014
  write: io=1851.7MB, bw=63021KB/s, iops=984 , runt= 30086msec
    slat (usec): min=13 , max=37378 , avg=19.62, stdev=218.17
    clat (msec): min=2 , max=232 , avg=64.96, stdev=28.10
     lat (msec): min=2 , max=232 , avg=64.98, stdev=28.10
    clat percentiles (msec):
     |  1.00th=[   18],  5.00th=[   22], 10.00th=[   28], 20.00th=[   37],
     | 30.00th=[   46], 40.00th=[   56], 50.00th=[   65], 60.00th=[   74],
     | 70.00th=[   84], 80.00th=[   93], 90.00th=[  103], 95.00th=[  111],
     | 99.00th=[  122], 99.50th=[  127], 99.90th=[  149], 99.95th=[  159],
     | 99.99th=[  182]
    bw (KB/s)  : min=51011, max=68992, per=99.91%, avg=62966.57, stdev=3461.16
    lat (msec) : 4=0.01%, 10=0.02%, 20=3.00%, 50=31.69%, 100=52.82%
    lat (msec) : 250=12.46%
  cpu          : usr=1.10%, sys=2.20%, ctx=29305, majf=0, minf=22
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=0/w=29626/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
  WRITE: io=1851.7MB, aggrb=63021KB/s, minb=63021KB/s, maxb=63021KB/s, mint=30086msec, maxt=30086msec

Disk stats (read/write):
  xvdo: ios=473/58952, merge=63/0, ticks=1401/3814956, in_queue=3821335, util=100.00%